from flask import Flask
from flask_pymongo import PyMongo


#Note: https://www.campingmap.gr/Macedonia
documents = [
    {
        'name': 'Afroditi',
        'photo': '../../assets/1.jpg' ,
        'location': 'Πλαταμώνας', 
        'description': 'Ένας μικρός, οργανωμένος χώρος κατασκήνωσης με έως 60 θέσεις, ιδανικός για ήρεμες διακοπές δίπλα στη θάλασσα. Βρίσκεται πάνω στο κύμα και προσφέρει εύκολη πρόσβαση στην παραλία, ενώ διαθέτει mini market, καφέ–μπαρ και βασικές παροχές για άνετη διαμονή, όπως ρεύμα στις θέσεις, πλυντήρια και ζεστό νερό όλο το 24ωρο. \
            Ο χώρος είναι φιλικός προς Α.Μ.Ε.Α., δέχεται κατοικίδια και τροχόσπιτα, με πλήρεις υποδομές για αυτά (αποχέτευση και εκκένωση χημικών τουαλετών). Επιπλέον, προσφέρονται υπηρεσίες πρώτων βοηθειών, ταχυδρομείου και τηλεόρασης, καλύπτοντας όλες τις βασικές ανάγκες για ξέγνοιαστη και άνετη διαμονή κοντά στη φύση.',
        'likes': 0
    },
    {
        'name': 'Agiannis Camping Hotel',
        'photo': '../../assets/2.jpg' ,
        'location': 'Μεθώνη Πιερίας', 
        'description': 'Στη Μεθώνη Πιερίας, που βρίσκεται στη σκιά του μυθικού Ολύμπου και των Πιέριων Όρων, μπροστά στην καταγάλανη θάλασσα του Θερμαϊκού κόλπου, θα συναντήσετε το τουριστικό συγκρότημα Camping - Hotel AGIANNIS, το οποίο λειτουργεί από το έτος 1968. Μόλις 24 χλμ από την πόλη της Κατερίνης, 43 χλμ από το λιμάνι της Θεσσαλονίκης και 60 χλμ από τον αερολιμένα Μακεδονία και με άμεση πρόσβαση μέσω των ΚΤΕΛ Πιερίας (Στάση Μακρύγιαλου) καθώς και με το τρένο (Σιδηροδρομικός σταθμός Αιγίνιου). Το υπέροχο τουριστικό αυτό συγκρότημα που είναι ανοιχτό και λειτουργεί από 1η Μαΐου έως και 30 Σεπτεμβρίου, βρίσκεται σε μία ειδυλλιακή καταπράσινη τοποθεσία ακριβώς δίπλα στη θάλασσα',
        'likes': 0
    },
    {
        'name': 'Akti Oneirou',
        'photo': '../../assets/3.jpg' ,
        'location': 'Άγιος Νικόλαος Σιθωνίας', 
        'description': 'To Akti Oneirou Luxury Camping βρίσκεται στην χερσόνησο της Σιθωνίας στη Χαλκιδική, 12 χλμ. μετά τον κόλπο της Βουρβουρούς στο δρόμο προς Σάρτη.\n \
                        Σε ένα περιβάλλον μοναδικού φυσικού κάλλους με ιδιωτική παραλία και γαλαζοπράσινα κρυστάλλινα νερά, συνδυάζει την χαλαρή ατμόσφαιρα ενός νησιού με την εκλεπτυσμένη φιλοξενία και την απαράμιλλη πολυτέλεια ενός μοντέρνου boutique resort.\n  \
                        Ένας χώρος πανέμορφος και προσεγμένος μέχρι την τελευταία του λεπτομέρεια, αποπνέει μια ιδιαίτερη ζεστασιά και κομψότητα που θα σας ξεκουράσει. \n \
                        Πολυτελή κάτασπρα bungalows, τροχοβίλες, ενοικιαζόμενα τροχόσπιτα και ξύλινα σπιτάκια που θυμίζουν μικρές βίλες, άνετες θέσεις για σκηνές και τροχόσπιτα μέσα στο δάσος και εγκαταστάσεις που θυμίζουν ξενοδοχείο 5 αστέρων, συνθέτουν μια εικόνα που θα σας ενθουσιάσει.',
        'likes': 0
    },
    {
        'name': 'Akti Retzika Camp',
        'photo': '../../assets/4.jpg' ,
        'location': 'Ποταμός Επανωμής', 
        'description': 'Το κάμπινγκ Akti Retzika λειτουργεί σε ένα καταπράσινο περιβάλλον, λίγα βήματα μακριά από την παραλία, με σεβασμό και αγάπη για το περιβάλλον.\n \
                        Στο χώρο κατασκήνωσης υπάρχουν 60 ευρύχωροι χώροι για αυτοκίνητα, τροχόσπιτα και σκηνές , ενώ στα μπανγκαλόου μπορείτε να απολαύσετε πιο άνετες διακοπές σε ένα φυσικό περιβάλλον.',
        'likes': 0
    },
    {
        'name': 'Alexandros Camping',
        'photo': '../../assets/5.jpg' ,
        'location': 'Καβάλα', 
        'description': 'Ένας οργανωμένος και άνετος χώρος διαμονής με 88 θέσεις, ιδανικός για οικογένειες και ταξιδιώτες που αναζητούν πλήρεις παροχές κοντά στη θάλασσα.\n \
                        Διαθέτει εστιατόριο, mini market, καφέ–μπαρ, Wi-Fi και ενοικιαζόμενα δωμάτια, προσφέροντας επιλογές τόσο για κάμπινγκ όσο και για πιο άνετη διαμονή.',
        'likes': 0
    },
    {
        'name': 'Alikes',
        'photo': '../../assets/6.jpg' ,
        'location': 'Αμμουλιανή', 
        'description': 'Το Camping Αλυκές Αμμουλιανή βρίσκεται στην βραβευμένη παραλία των Αλυκών, στην Αμμουλιανή Χαλκιδικής διαθέτοντας 105 σύγχρονες θέσεις για τροχόσπιτα, σκηνές αλλά και τροχοσκηνές μέσα σε ευκαλύπτους, αγριοτζιτζιφιές, ελιές, λεμονιές και πεύκα καλυπτόμενες από φυσική ή τεχνητή ηλιοπροστασία. (σε όλες τις θέσεις έχει τοποθετηθεί τεχνητή ηλιοπροστασία το έτος 2010 για καλύτερη σκίαση).',
        'likes': 0
    },
    {
        'name': 'Anamour Camping',
        'photo': '../../assets/7.jpg' ,
        'location': 'Συκιά Χαλκιδικής', 
        'description': 'Το Camping Anamour βρίσκεται στην χερσόνησο της Σιθωνίας, στη Χαλκιδική. Η περιοχή ονομάζεται από τους ντόπιους Τριστινικούδα, ένας μικρός κόλπος μεταξύ Τριστινίκας και Τορώνης, που απέχει 20 χλμ από τον Νέο Μαρμαρά.',
        'likes': 0
    },
    {
        'name': 'Arion',
        'photo': '../../assets/8.jpg' ,
        'location': 'Παραλία Παντελεήμονα, Πιερία', 
        'description': 'Σας περιμένουν μία πεντακάθαρη θάλασσα στη μαγευτική του παραλία με θέα τον Όλυμπο, πλούσια σκιά καλλωπιστικών δέντρων, σύγχρονες εγκαταστάσεις με απόλυτη καθαριότητα, φιλικό, οικογενειακό περιβάλλον, έτοιμο να σας εξυπηρετήσει.',
        'likes': 0
    },
    {
        'name': 'Armenistis',
        'photo': '../../assets/9.jpg' ,
        'location': 'Σάρτη Χαλκιδικής', 
        'description': 'Το Camping σας προσκαλεί σ᾽ έναν κόσμο εναλλακτικών διακοπών με χρυσαφένιες αμμουδιές, κρυστάλλινα νερά, πολύ πράσινο, αλλά και με ανέσεις, γευστικές απολαύσεις και άψογη περιποίηση.',
        'likes': 0
    },
    {
        'name': 'Castello',
        'photo': '../../assets/10.jpg' ,
        'location': 'Ν.Μαρμαράς, Χαλκιδική', 
        'description': 'Το Camping Castello είναι ο δικός σας καλοκαιρινός προορισμός στη Σιθωνία Χαλκιδικής, μόλις 3χλμ. απόσταση από τον Ν. Μαρμαρά./n \
                        Ένας επίγειος παράδεισος που συνδυάζει το πλούσιο φυσικό τοπίο με τα κρυστάλλινα νερά και την πανέμορφη παραλία.',
        'likes': 0
    },
    {
        'name': 'Christina Kriaritsi',
        'photo': '../../assets/11.jpg',
        'location': 'Κριαρίτσι Συκιάς, Χαλκιδική', 
        'description': 'Organized camping facilities in front of the beautiful sea of Kriaritsi beach.You can place your own or rent one from our luxury tents or caravans.',
        'likes': 0
    },
    {
        'name': 'Daedalos Camping',
        'photo': '../../assets/12.jpg',
        'location': 'Σκάλα Σωτήρος, Θάσος', 
        'description': 'Ένας πλήρως εξοπλισμένος χώρος διαμονής με 98 θέσεις, ιδανικός για άνετες και ζωντανές διακοπές κοντά στη θάλασσα.\n \
                        Προσφέρει εστιατόριο, mini market, Wi-Fi και δυνατότητα ενοικίασης σκηνών, καλύπτοντας τόσο οργανωμένο camping όσο και πιο ευέλικτες επιλογές διαμονής.',
        'likes': 0
    },
    {
        'name': 'Delphini',
        'photo': '../../assets/13.jpg' ,
        'location': 'Ιερισσός Χαλκιδικής', 
        'description': 'Πρόκειται  για ένα ωραίο τουριστικό θέρετρο!',
        'likes': 0
    },
    {
        'name': 'Evridiki',
        'photo': '../../assets/14.jpg' ,
        'location': 'Γρίτσα Λιτοχώρου', 
        'description': 'Ένας μεγάλος, οργανωμένος χώρος camping με 216 θέσεις, κοντά στη θάλασσα, ιδανικός για άνετη και λειτουργική διαμονή.',
        'likes': 0
    },
    {
        'name': 'Goldbeach',
        'photo': '../../assets/15.jpg',
        'location': 'Βαρικός Λιτοχώρου', 
        'description': 'Ένας μικρός και ήσυχος χώρος camping με 50 θέσεις, ιδανικός για χαλαρές διακοπές δίπλα στη θάλασσα.\n \
                        Προσφέρει βασικές ανέσεις όπως εστιατόριο, ρεύμα στις θέσεις και δυνατότητα φιλοξενίας κατοικιδίων, ενώ διαθέτει και οργανωμένες παροχές για τροχόσπιτα.',
        'likes': 0
    },
    {
        'name': 'Kriopigi',
        'photo': '../../assets/16.jpg' ,
        'location': 'Κρυοπηγή Χαλκιδικής', 
        'description': 'Ένας παραθαλάσσιος χώρος camping με 105 θέσεις, ιδανικός για ήρεμες διακοπές κυριολεκτικά πάνω στο κύμα.\n \
                        Προσφέρει βασικές ανέσεις όπως εστιατόριο, mini market και παροχή ρεύματος στις θέσεις, καλύπτοντας τις καθημερινές ανάγκες των επισκεπτών.',
        'likes': 0
    },
    {
        'name': 'Lacara',
        'photo': '../../assets/17.jpg' ,
        'location': 'Ακτή Κουτλουμουσίου, Σιθωνία', 
        'description': 'Στη μαγευτική Σιθωνία Χαλκιδικής, 8 χλμ μετά τη Βουρβουρού μέσα σε μια μοναδική πανδαισία χρωμάτων φυσικής ομορφιάς με το πλούσιο πλατανόδασος, βρίσκεται το Camping Lacara, έτοιμο να προσφέρει σε όλους αξέχαστες διακοπές.',
        'likes': 0
    },
    {
        'name': 'Marmaras',
        'photo': '../../assets/18.jpg' ,
        'location': 'Νέος Μαρμαράς, Χαλκιδική', 
        'description': 'Μέσα σε ένα μαγευτικό περιβάλλον, που συνδυάζει το πευκόφυτο δάσος με την ομορφιά της θάλασσας της Σιθωνίας , στην άκρη του Ν. Μαρμαρά το κάμπινγκ Μαρμαράς αγκαλιάζει ένα κολπίσκο με ψιλή χρυσή άμμο. Οι θέσεις είναι αμφιθεατρικά διαμορφωμένες σε επίπεδα και έχουν φυσική σκιά από τα πεύκα και ανεμπόδιστη θέα στη θάλασσα.',
        'likes': 0
    },
    {
        'name': 'Mitikas Camping',
        'photo': '../../assets/19.jpg' ,
        'location': 'Γρίτσα Λιτιχώρου', 
        'description': 'Το Κάμπινγκ Μύτικας είναι ένα πολύ οργανωμένο οικογενειακό κάμπινγκ, το οποίο βρίσκεται στην Γρίτσα Λιτοχώρου, στην Πιερία.\n \
                         Βρίσκεται μόνο 100μ από μια πολύ όμορφη και καθαρή παραλία και έχει εκπληκτική θέα τον Όλυμπο, το ψηλότερο βουνό της Ελλάδας και κατοικία των 12 Θεών της Ελληνικής Μυθολογίας',
        'likes': 0
    },
    {
        'name': 'Olympios Zeus',
        'photo': '../../assets/20.jpg' ,
        'location': 'Πλάκα Λιτοχώρου,', 
        'description': 'Σε μια καταπράσινη έκταση 52 στρεμμάτων μπροστά στη θάλασσα, τo camping Olympios Zeus σας προσφέρει την ευκαιρία να βρεθείτε μέσα στη φύση ξεχνώντας για λίγο την καθημερινότητα της πολύβουης πόλης.\n \
              Διαθέτει πλούσια βλάστηση και σκίαση ενώ είναι πλήρως οργανωμένος, ώστε να σας εξασφαλίσει μια άνετη διαμονή.',
        'likes': 0
    },
]

def main():
    print("Hello from project!")
    app = Flask(__name__)
    app.config["MONGO_URI"] = "mongodb://localhost:27017/mydatabase"
    
    mongo = PyMongo(app)

if __name__ == "__main__":
    main()
